LIT/load-test.yaml
config:
  target: "https://api.development.tria.so"
  phases:
    - duration: 1
#      arrivalRate: 1
#      rampTo: 1
      arrivalCount: 1
  processor: "./processor.js"
  variables:
#    Prod Client ID
#    fromClientId: "124311390b11c9a6a83eb06d98b22cdf:be8390e8b496cf4ee27e27be61112ac1e5fa081fd55eb628e0c85cae70b162ff574188399be40177b91bfe71340b50844896b11eec08b0e90eeae1ef435ea1634da78c8021e248555148dc067c4aea90f3ccb3fc795dc7df384e60ad6194a755ca57ff536fb5:676698a6c04c086f2b6bec068023ddd9"
#    Staging Client ID
    fromClientId: "4b6ee1ce04a7f7231e09a81c0826bf3b:03331a356587a5b0a96176bba4deb3b951ad9e2dd7d009e29ecc01d1a0256e6fa0cdb1e2a00f2279fc361cfa37039f0fb9b402dc01d7a26b471fb52f2a0223677189256e7a2115aea2217eff8d9b965ee0eafc55d3b5ce3e1ea434f557fa69c4039cc51c770d:252f7ae04e39f8d39980b4acf4887935"
    origin: "https://tria-demo-staging.vercel.app"
    otp: "7R9K3P5A1Q"
  http:
    timeout: 60
scenarios:
  - flow:
      - function: "getRandomUsername"
      - log: "Generated username: {{ username }}"
      - post:
          url: "/api/v2/auth/initiate-otp"
          json:
            email: "{{ username }}@yopmail.com"
            origin: "{{ origin }}"
            fromClientId: "{{ fromClientId }}"
          headers:
            Content-Type: "application/json"
          afterResponse: "captureResponse"
      - log: "Initiate OTP executed"
      - think: 10
      - post:
          url: "/api/v2/auth/verify-otp"
          json:
            otp: "{{ otp }}"
            email: "{{ username }}@yopmail.com"
            fromClientId: "{{ fromClientId }}"
          headers:
            Content-Type: "application/json"
          capture:
            - json: "$.accessToken"
              as: "accessToken"
          afterResponse: "captureResponse"
      - log: "Access Token acquired from Verify OTP: {{ accessToken }}"
      #      - function: "connectSocket"  # Call the function to connect the socket
      - think: 10
      - post:
          url: "/api/v2/did/check"
          json:
            did: "{{ username }}@tria"
          headers:
            Content-Type: "application/json"
          capture:
            - json: "$.response.availabilityStatus"
              as: "availabilityStatus"
          afterResponse: "captureResponse"
      - log: "Check DID response: {{ availabilityStatus }}"
      - think: 10
      - get:
          url: "/api/v2/get-name-recommendation"
          qs:
            name: "{{ username }}"
          capture:
            - json: "$.data"
              as: "recommendations"
          afterResponse: "captureResponse"
      - log: "Name recommendations: {{ recommendations }}"
      - think: 10
      - function: "mintPKP"
      - log: "Minting done"
      - log: "Running getPKP"
      - function: "getPKP"
      - think: 10 # Adding 10 seconds delay before running getCreateDIDData
      - function: "getCreateDIDData"
      - log: "DID Data Generated"
      - log: "{{ DIDData }}"
      - log: "Bearer {{ accessToken }}"
      - post:
          url: "/api/v1/did/create"
          json: "{{ DIDData }}"
          headers:
            Content-Type: "application/json"
            Authorization: "Bearer {{ accessToken }}"
          capture:
            - json: "$"
              as: "Status"
          afterResponse: "captureResponse"
      - log: "Create DID response: {{ Status }}"

after:
  flow:
    - log: "Uploading Data to S3"
    - function: "uploadToS3"